tutorials/multiphase/interDyMFoam/damBreakWithObstacle_with_ACMI/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            fixedFluxPressure;
        phi             phiAbs;
        value           uniform 0;
    }

    obstacle
    {
        type            fixedFluxPressure;
        phi             phiAbs;
        value           uniform 0;
    }

    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }


    ACMI1_blockage
    {
        type            fixedFluxPressure;
        phi             phiAbs;
        value           uniform 0;
    }
    ACMI1_couple
    {
        type            cyclicACMI;
        value           $internalField;
    }
    ACMI2_blockage
    {
        type            fixedFluxPressure;
        phi             phiAbs;
        value           uniform 0;
    }
    ACMI2_couple
    {
        type            cyclicACMI;
        value           $internalField;
    }
}

// ************************************************************************* //
