tutorials/multiphase/interDyMFoam/damBreakWithObstacle_with_ACMI/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)


    // Block2
    (1 0 0)
    (2 0 0)
    (2 1 0)
    (1 1 0)
    (1 0 1)
    (2 0 1)
    (2 1 1)
    (1 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 32 32) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (32 32 32) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (3 7 6 2)

            // Block2
            (11 15 14 10)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)

            // Block2
            (10 14 13 9)
            (9 13 12 8)
            (8 11 10 9)
            (12 13 14 15)
        );
    }

    couple1
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    couple2
    {
        type patch;
        faces
        (
            (8 12 15 11)
        );
    }
);

// ************************************************************************* //
