tutorials/multiphase/interDyMFoam/damBreakWithObstacle_with_ACMI/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // cellSet for cut-out
    // ~~~~~~~~~~~~~~~~~~~

    {
        name    c0;
        type    cellSet;
        action  clear;
    }
    {
        name    c0;
        type    cellSet;
        action  invert;
    }
    {
        name    c0;
        type    cellSet;
        action  delete;
        source  boxToCell;
        sourceInfo
        {
            box (0.375 0.375 0) (0.625 0.625 0.25);
        }
    }




    // Get both sides of ami
    // ~~~~~~~~~~~~~~~~~~~~~

    // Create faceZone for patch couple1
    {
        name    couple1FaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name    couple1;
        }
    }
    {
        name    couple1Faces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet couple1FaceSet;
        }
    }

    // Create faceZone for patch couple2
    {
        name    couple2FaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name    couple2;
        }
    }
    {
        name    couple2Faces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet couple2FaceSet;
        }
    }
);

// ************************************************************************* //
